{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.14.0", "signature": {"inputs": {"dense_267_input": {"name": "dense_267_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}]}}}, "outputs": {"dense_271": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_66/dense_267/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_267/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_268/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_268/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_269/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_269/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_270/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_270/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_271/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_271/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_267_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "13"}]}}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_267/BiasAdd", "op": "_FusedMatMul", "input": ["dense_267_input", "StatefulPartitionedCall/sequential_66/dense_267/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_66/dense_267/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_66/dense_267/BiasAdd", "StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/mul_1", "StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/activation_201/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_268/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_66/activation_201/Relu", "StatefulPartitionedCall/sequential_66/dense_268/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_66/dense_268/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_66/dense_268/BiasAdd", "StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/mul_1", "StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/activation_202/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_269/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_66/activation_202/Relu", "StatefulPartitionedCall/sequential_66/dense_269/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_66/dense_269/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_66/dense_269/BiasAdd", "StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/mul_1", "StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/activation_203/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_270/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_66/activation_203/Relu", "StatefulPartitionedCall/sequential_66/dense_270/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_66/dense_270/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_66/dense_270/BiasAdd", "StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/mul_1", "StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/activation_204/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_271/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_66/activation_204/Relu", "StatefulPartitionedCall/sequential_66/dense_271/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_66/dense_271/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_66/dense_271/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_66/dense_271/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_66/dense_271/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_66/dense_267/MatMul/ReadVariableOp", "shape": [13, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_267/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/mul", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_189/batchnorm/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_268/MatMul/ReadVariableOp", "shape": [512, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_268/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_190/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_269/MatMul/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_269/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_191/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_270/MatMul/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_270/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/batch_normalization_192/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_271/MatMul/ReadVariableOp", "shape": [64, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_66/dense_271/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}