{
    "format": "graph-model",
    "generatedBy": "2.14.0",
    "convertedBy": "TensorFlow.js Converter v4.13.0",
    "signature": {
        "inputs": {
            "dense_15_input": {
                "name": "dense_15_input:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "13"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "dense_17": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "10"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_15/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "13"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_15/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_16/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_16/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_17/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "10"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_17/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "10"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dense_15_input",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "13"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_15/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "dense_15_input",
                    "StatefulPartitionedCall/sequential_5/dense_15/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_5/dense_15/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "transpose_a": {
                        "b": false
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/sequential_5/dense_15/BiasAdd",
                    "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/add_1",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/mul_1",
                    "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/sub"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/activation_10/Relu",
                "op": "Relu",
                "input": [
                    "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/add_1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_16/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential_5/activation_10/Relu",
                    "StatefulPartitionedCall/sequential_5/dense_16/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_5/dense_16/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "num_args": {
                        "i": "1"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "transpose_a": {
                        "b": false
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/sequential_5/dense_16/BiasAdd",
                    "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/add_1",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/mul_1",
                    "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/sub"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/activation_11/Relu",
                "op": "Relu",
                "input": [
                    "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/add_1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_17/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential_5/activation_11/Relu",
                    "StatefulPartitionedCall/sequential_5/dense_17/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_5/dense_17/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "epsilon": {
                        "f": 0.0
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "transpose_a": {
                        "b": false
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_5/dense_17/Softmax",
                "op": "Softmax",
                "input": [
                    "StatefulPartitionedCall/sequential_5/dense_17/BiasAdd"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Identity",
                "op": "Identity",
                "input": [
                    "StatefulPartitionedCall/sequential_5/dense_17/Softmax"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            }
        ],
        "library": {},
        "versions": {
            "producer": 1645
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "StatefulPartitionedCall/sequential_5/dense_15/MatMul/ReadVariableOp",
                    "shape": [
                        13,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/dense_15/BiasAdd/ReadVariableOp",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/mul",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/batch_normalization_10/batchnorm/sub",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/dense_16/MatMul/ReadVariableOp",
                    "shape": [
                        256,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/dense_16/BiasAdd/ReadVariableOp",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/mul",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/batch_normalization_11/batchnorm/sub",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/dense_17/MatMul/ReadVariableOp",
                    "shape": [
                        128,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_5/dense_17/BiasAdd/ReadVariableOp",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}